namespace Heimdallr.ToolKit.Enums;
/// <summary>
/// 제품 단위를 나타내는 열거형입니다.
/// </summary>
public enum ProductUnit
{
  /// <summary>
  /// 각 제품 단위를 나타냅니다.
  /// </summary>
  Each,

  /// <summary>
  /// 제품 단위를 묶음으로 나타냅니다. 일반적으로 여러 개의 제품이 함께 판매되는 경우에 사용됩니다.
  /// </summary>
  Pack,

  /// <summary>
  /// 제품 단위를 상자 단위로 나타냅니다. 일반적으로 포장된 제품이 상자에 들어 있는 경우에 사용됩니다.
  /// </summary>
  Box,

  /// <summary>
  /// 제품 단위를 묶음으로 나타냅니다. 일반적으로 여러 개의 제품이 함께 묶여 판매되는 경우에 사용됩니다.
  /// </summary>
  Dozen,

  /// <summary>
  /// 제품 단위를 그램 단위로 나타냅니다. 일반적으로 무게가 가벼운 제품에 사용됩니다.
  /// </summary>
  Gram,

  /// <summary>
  /// 제품 단위를 킬로그램 단위로 나타냅니다. 일반적으로 무게가 무거운 제품에 사용됩니다.
  /// </summary>
  Kilogram,

  /// <summary>
  /// 제품 단위를 밀리그램 단위로 나타냅니다. 일반적으로 매우 가벼운 제품에 사용됩니다.
  /// </summary>
  Milliliter,

  /// <summary>
  /// 제품 단위를 리터 단위로 나타냅니다. 일반적으로 액체 제품의 용량을 측정하는 데 사용됩니다.
  /// </summary>
  Liter,

  /// <summary>
  /// 제품 단위를 미터 단위로 나타냅니다. 일반적으로 길이를 측정하는 데 사용됩니다.
  /// </summary>
  Meter,

  /// <summary>
  /// 제품 단위를 제곱미터 단위로 나타냅니다. 일반적으로 면적을 측정하는 데 사용됩니다.
  /// </summary>
  SquareMeter,

  /// <summary>
  /// 제품 단위를 세제곱미터 단위로 나타냅니다. 일반적으로 부피를 측정하는 데 사용됩니다.
  /// </summary>
  CubicMeter,

  /// <summary>
  /// 제품 단위를 개별 조각으로 나타냅니다. 일반적으로 작은 제품이나 부품에 사용됩니다.
  /// </summary>
  Piece,

  /// <summary>
  /// 제품 단위를 세트로 나타냅니다. 일반적으로 여러 개의 제품이 함께 구성된 경우에 사용됩니다.
  /// </summary>
  Set,

  /// <summary>
  /// 제품 단위를 롤 단위로 나타냅니다. 일반적으로 긴 형태의 제품에 사용됩니다.
  /// </summary>
  Roll,

  /// <summary>
  /// 제품 단위를 묶음으로 나타냅니다. 일반적으로 여러 개의 제품이 함께 포장된 경우에 사용됩니다.
  /// </summary>
  Bundle,

  /// <summary>
  /// 제품 단위를 병 단위로 나타냅니다. 일반적으로 액체 제품이 병에 담겨 있는 경우에 사용됩니다.
  /// </summary>
  Bottle,

  /// <summary>
  /// 제품 단위를 봉지 단위로 나타냅니다. 일반적으로 작은 제품이나 식품이 봉지에 담겨 있는 경우에 사용됩니다.
  /// </summary>
  Bag,

  /// <summary>
  /// 제품 단위를 캔 단위로 나타냅니다. 일반적으로 음료나 식품이 캔에 담겨 있는 경우에 사용됩니다.
  /// </summary>
  Can,

  /// <summary>
  /// 제품 단위를 튜브 단위로 나타냅니다. 일반적으로 크림, 연고, 페인트 등이 튜브에 담겨 있는 경우에 사용됩니다.
  /// </summary>
  Tube,

  /// <summary>
  /// 제품 단위를 시트 단위로 나타냅니다. 일반적으로 종이나 얇은 재료가 시트 형태로 제공되는 경우에 사용됩니다.
  /// </summary>
  Sheet,

  /// <summary>
  /// 제품 단위를 단위로 나타냅니다. 일반적으로 개별 제품을 나타내는 데 사용됩니다.
  /// </summary>
  Unit,
}
